public class Main {}
// Strategy - поведенческий паттерн.

// Strategy pattern - определяет Семейство алгоритмов, инкапсулирует эти алгоритмы и делает их
// взаимозаменяемыми. Стратегия позволяет изменять алгоритмы независимо от клиентов, которые ими
// пользуются.

// Cемейство алгоритмов - набор разных Реализованных поведений.
// Например PaymentMethod и его Реализации это Семейство Алгоритмов.

// Алгоритм - одна из реализаций поведения.

// Пример из Java - Collections.sort(), который принимает любой Обьект, который реализовал
// реализовал интерфейс Comparator и опеределить метод compare().
