package ru.beloshitsky;

public class Ports {
}
// Представим наш Дом, у которого есть 20 разных Ящиков для разной Почты. В один приходит Почта с работы, в другой
// что-то связанное с интернетом, в другой личная почта и тд.

// Если IP это как Адрес дома, в который мы хотим доставить письмо, то Порт это как разные ящики в этом доме.
// HTTP запросы приходят в Порт 80, Почта в порт 110 и тд.

// Если приложение "слушает"(listening) порт 80, значит приложение Открыло порт 80 и ждет оттуда информацию.
